---
kind: type
id: T:Autodesk.Revit.DB.LabelType
source: html/018ae2fa-99f8-5788-40bb-d6ca5de2681c.htm
---
# Autodesk.Revit.DB.LabelType

The label type in dimension equality formats.

## Syntax (C#)
```csharp
public enum LabelType
```